Rails DB/Stadium-Delivery-Rails-DB/app/controllers/api/v1/orders_controller.rb

  def create
    new = Order.create(order_params)
    params[:products].each do |prod|
      new.orderproducts.create({ product_id: prod[:id]})
---
INSERT INTO "orders" ("user_id", "product_id", "sales_tax", "fees", "tips", "total_price", "order_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "products".* FROM "products" WHERE "products"."order_id" = ?  [["order_id", 11]]
SELECT "orders".* FROM "orders"
SELECT "orderproducts".* FROM "orderproducts" WHERE "orderproducts"."order_id" = ?  [["order_id", "2"]]

    def find_product
      @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]